package com.company;

public class TaskList {
    /*
    Задание 1
    В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
    Использование YouTube, Quizful приветствуется.

    Задание 2
    Вывод на экран элементов List:
    Создать список, заполнить его на 10 элементов и вывести на экран содержимое используя iterator.

    Дополнительное
    В папке с примерами, ex_004_comparable.
    Дописать логику, чтобы метод compareTo() осуществил поиск по скорости(если же скорость у 2-х объектов
    равна, то ищем по цене) -> цене - > моделе -> цвету машины.

    Лабораторка
    Создайте класс Product с полями: Имя продукта, цена, количество. Создайте 2
    отдельных класса, реализующих интерфейс Comparator, а именно метод
    compare() для сортировки объектов по названию и по цене. Затем создайте несколько
    коллекций продуктов (массив и ArrayList) и вызовите метод Arrays.sort() или Collections.sort() соответственно,
    который выполняет сортировку и принимает в качестве параметров массив/список продуктов и объект
    класса реализующий интерфейс Comparator. Выведите список продуктов (ArrayList) через итератор
     */

}
