package com.company;

public class TaskList {

    /*
    Задание 1
    В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы
    и закрепить материал. Использование YouTube, Quizful приветствуется.

    Задание 2
    Создайте файл, запишите в него произвольные данные и закройте файл.
    Затем снова откройте этот файл, прочитайте из него данные и выведете их на консоль.

    Задание 3
    Необходимо создать строку с текстом (текст взять любой из интернета).
    Разбить эту строку на 2 подстроки равной длине и вывести на экран каждое предложения с новой строки.

    Дополнительное
    Задание
    Создайте в package текстовый файл и клас, внесите в файл некий текст.
    Выведите на экран содержимое файла.

    Лабораторка1
    Пользователь с клавиатуры вводит путь к файлу. После
    чего содержимое файла отображается на экране.

    Лабораторка2
    Пользователь с клавиатуры вводит пути к трем
    файлам. Программа должна содержимое двух файлов
    записать в третий файл.

    Лабораторка3
    Создайте класс, который создает и заполняет файл 'part.txt' случайными
    целыми числами от 0 до 50 (всего 10 чисел), затем читает файл и записывает его
    содержимое в другой файл ('part_sorted.txt'). Числа должны быть отсортированы в
    порядке возрастания. Отобразите содержимое обоих файлов в консоли (числа
    должны быть разделены пробелом). Выходной файл должен быть доступен для чтения.

    Пример вывода:
    input ==> 30 23 16 16 9 23 3 18 21 29
    output ==> 3 9 16 16 18 21 23 23 29 30


     */
}
