package com.company;

public class TaskList {

    /*
    Задание 1
    В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал. Использование YouTube, Quizful приветствуется.

    Задание 2
    Напишите программу, которая будет выводить всю информацию о классе, пользователь сам выбирает, какой именно класс интересует.

    Задание 3
    Создайте класс, в нем определите 3 поля, к этим полям создайте конструкторы и методы.
    Под средством рефлексии получите всю информацию о полях, методах, конструкторах, а также модификаторах
    доступа

    Дополнительное
    Создайте 2 класса, Animal и Cat.
    В классе Animal инициализируйте 3 поля различных модификаторов.
    В классе Cat используя рефлексию получите доступ к полям класса Animal и измените содержимое каждого из полей.

    Лабораторка
    Создайте класс Cat с двумя полями: name и age и обязательным методом sayMeow()
    - выведите информацию о модификаторах класса, полях, методах, константах, конструкторах и суперклассах
    - получите и установите значение полей объекта по имени
    - вызовите метод объекта sayMeow() по имени
     */
}
