package com.company;

public class TaskList {

    /*

    Задание 1
    В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал. Использование YouTube, Quizful приветствуется.

    Задание 2
    Напишите шуточную программу «Дешифратор», которая бы в текстовом файле могла бы заменить все предлоги на слово «Java».

    Задание 3
    Спроектируйте и разработайте метод, определяющий, сколько времени прошло с заданной даты.
    С помощью этого методы выведите в консоль, сколько времени прошло с вашего дня рождения в удобном для восприятия виде,
    например: «Вам исполнилось 20 лет, 3 месяца, 18 дней, 4 часа, 5 минут и 10 секунд».

    Дополнительное
    Напишите консольное приложение, позволяющие пользователю зарегистрироваться под «Логином»,
    состоящем только из символов латинского алфавита, и пароля, состоящего из цифр и символов.

    Лабораторка 1
    Дана строка 'ahb acb aeb aeeb adcb axeb'. Напишите регулярное выражение, которая найдет строки ahb, acb, aeb по
    шаблону: буква 'a', любой символ, буква 'b'. Выведите строки на консоль

    Лабораторка 2
    Дана строка 'aa aba abba abbba abca abea'. Напишите регулярное выражение, которая найдет строки aa, aba, abba, abbba по
    шаблону: буква 'a', буква 'b' любое количество раз (в том числе ниодного раза), буква 'a'. Выведите строки на консоль

    Лабораторка 3
    Дана строка “Versions: Java  5, Java 6, Java   7, Java 8.”  Найти все подстроки "Java X" и распечатать их.

    Лабораторка 4
    Напишите регулярные выражения, которые бы проверяли корректность введенных пользователем полей.
    Для регистрации в приложении поля должны соответствовать таким требованиям:
    логин - не более 10 символов большими или маленькими буквами
    номер телефона - иметь шаблон +38(098)77 88 999 или +38(098)77-88-999
    email - на ваше усмотрение
     */
}
