package com.company;

public class TaskList {

    /*

    Задание 1
    В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
    Использование YouTube, Quizful приветствуется.

    Задание 2
    Используя коллекцию удвойте слово:
    1. Введите с клавиатуры 5 слов в список строк.
    2. Метод doubleValues должен удваивать слова по принципу a,b,c -> a,a,b,b,c,c.
    3. Используя цикл for выведите результат на экран, каждое значение с новой строки.

    Задание 3
    Минимальное из N чисел(использовать LinkedList):
    1. Ввести с клавиатуры число N.
    2. Считать N целых чисел и заполнить ими список - метод getIntegerList.
    3. Найти минимальное число среди элементов списка - метод getMinimum.

    Задание 4
    Программа определяет, какая семья (фамилия) живёт в городе:
    Пример ввода:
    
    Москва
    
    Ивановы
    
    Киев
    
    Петровы
    
    Лондон
    
    Абрамовичи
    
    Лондон
    Пример вывода:
    
    Абрамовичи

    Дополнительное
    Вводить с клавиатуры строки, пока пользователь не введёт строку 'end':
    1. Создать список строк.
    2. Ввести строки с клавиатуры и добавить их в список.
    3. Вводить с клавиатуры строки, пока пользователь не введёт строку "end". "end" не учитывать.
    4. Вывести строки на экран, каждую с новой строки.

    * посмотреть видео Java Collection Framework (Map)
    https://itvdn.com/ru/video/java-professional/java-collection-framework2

    Лабораторка 1
    Разработать приложение, имитирующее очередь запросов к серверу. Должны быть клиенты, посылающие
    запросы на сервер, у каждого из которых есть свой приоритет.
    Каждый новый клиент попадает в очередь в зависимости от своего приоритета.
    Для решения задачи используйте подходящий класс из Java Collections Framework.

    Лабораторка 2
    Необходимо разработать приложение, которое позволит сохранять информацию о логинах пользователей
    и их паролях. Каждому пользователю соответствует
    пара логин — пароль. При старте приложение отображается меню:
    1. Добавить нового пользователя;
    2. Удалить существующего пользователя;
    3. Проверить существует ли пользователь;
    4. Изменить логин существующего пользователя;
    5. Изменить пароль существующего пользователя;
    В зависимости от выбора пользователя выполняется действие, после чего меню отображается снова.
    Для решения задачи используйте подходящий класс из Java Collections Framework.
    * */
    }

